Revit 2027 API
Field.ContainerType Property
 Reports whether this is a simple field containing one value, or a container of multiple values.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ContainerType ContainerType { get; }
Public ReadOnly Property ContainerType As ContainerType
	Get
public:
property ContainerType ContainerType {
	ContainerType get ();
}
member ContainerType : ContainerType with get
Property Value
ContainerType
See Also
Reference
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace